app/controllers/projects_controller.rb

SELECT "roadworks".* FROM "roadworks" WHERE "roadworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "projects" ("roadwork_id", "name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @roadwork = Roadwork.find(params[:roadwork_id])
    @project = Project.new(project_params)
    @project.roadwork = @roadwork
    if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 4]]
---
  def destroy
    @project = Project.find(params[:id])
    @roadwork = @project.roadwork
    @project.destroy