app/controllers/roadworks_controller.rb

SELECT "roadworks".* FROM "roadworks"
---
  def index
    @roadworks = Roadwork.all

SELECT "roadworks".* FROM "roadworks" WHERE "roadworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @roadwork = Roadwork.find(params[:id])

INSERT INTO "roadworks" ("name", "banner_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @roadwork = Roadwork.new(roadwork_params)
    if @roadwork.save