app/views/roadworks/show.html.erb

  <div class="cards">
    <% @roadwork.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."roadwork_id" = $1  [["roadwork_id", 1]]